IRP/src/Catalogs/AccessGroups/AccessGroups.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>AccessGroups</name>
  <tabularSections>
    <name>Profiles</name>
    <attributes>
      <name>Profile</name>
      <type>
        <types>CatalogRef.AccessProfiles</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Users</name>
    <attributes>
      <name>User</name>
      <type>
        <types>CatalogRef.Users</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AddAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AddAttributeAndProperty</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ObjectAccess</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AccessKey</name>
      <type>
        <types>CatalogRef.AccessKey</types>
      </type>
    </attributes>
    <attributes>
      <name>ValueRef</name>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
    <attributes>
      <name>Modify</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>DoNotControl</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>String</types>
        <types>Date</types>
        <types>Boolean</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/AccessGroups/Forms/ItemForm/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	LocalizationEvents.CreateMainFormItemDescription(ThisObject, "GroupDescriptions");
	ExtensionServer.AddAttributesFromExtensions(ThisObject, Object.Ref, Items.GroupMainPages);
	AddAttributesAndPropertiesServer.OnCreateAtServer(ThisObject);
EndProcedure

&AtServer
Procedure BeforeWriteAtServer(Cancel, CurrentObject, WriteParameters)
	AddAttributesAndPropertiesServer.BeforeWriteAtServer(ThisObject, Cancel, CurrentObject, WriteParameters);
EndProcedure

&AtClient
Procedure NotificationProcessing(EventName, Parameter, Source)
	If EventName = "UpdateAddAttributeAndPropertySets" Then
		AddAttributesCreateFormControl();
	EndIf;
EndProcedure

&AtClient
Procedure DescriptionOpening(Item, StandardProcessing) Export
	LocalizationClient.DescriptionOpening(Object, ThisObject, Item, StandardProcessing);
EndProcedure

&AtClient
Procedure ObjectAccessDoNotControlOnChange(Item)
	CurrentRow = Items.ObjectAccess.CurrentData;
	CurrentRow.ValueRef = Undefined;
EndProcedure

&AtClient
Procedure CopySettings(Command)
	NotifyOnClose = New NotifyDescription("CopySettingsAfterSelect", ThisObject);
	OpenForm("Catalog.AccessGroups.ChoiceForm", , , , , , NotifyOnClose);
EndProcedure

&AtClient
Procedure CopySettingsAfterSelect(Result, AddInfo) Export
	If Not ValueIsFilled(Result) Then
		Return;
	EndIf;
	CopySettingsAtServer(Result);
EndProcedure

// Copy settings at server.
// 
// Parameters:
//  SelectedAG - CatalogRef.AccessGroups -
&AtServer
Procedure CopySettingsAtServer(SelectedAG)
	For Each Row In SelectedAG.ObjectAccess Do
		FillPropertyValues(Object.ObjectAccess.Add(), Row);
	EndDo;
EndProcedure

&AtClient
Procedure ObjectAccessAccessKeyOnChange(Item)
	CurrentRow = Items.ObjectAccess.CurrentData;
	CurrentRow.Key = String(CurrentRow.AccessKey);
EndProcedure

#Region AddAttributes

&AtClient
Procedure AddAttributeStartChoice(Item, ChoiceData, StandardProcessing) Export
	AddAttributesAndPropertiesClient.AddAttributeStartChoice(ThisObject, Item, StandardProcessing);
EndProcedure

&AtServer
Procedure AddAttributesCreateFormControl()
	AddAttributesAndPropertiesServer.CreateFormControls(ThisObject);
EndProcedure

&AtClient
Procedure AddAttributeButtonClick(Item) Export
	AddAttributesAndPropertiesClient.AddAttributeButtonClick(ThisObject, Item);
EndProcedure

#EndRegion
